"use strict";

var app = angular.module('productsApp', []);
app.controller("tableController", ["$scope", "GetTableData", function ($scope, GetTableData) {

    $scope.tableData = [{ "id": "Идентификатор", "name": "Название", "price": "Стоимость", "quantity": "Количество" }, [1, "банан", "400", 5], [2, "арбуз", "300", 6], [3, "помидор", "205", 7], [4, "ручка", "500", 1], [5, "карандаш", "600", 2], [6, "дыня", "700", 3], [7, "мышка", "400", 4], [8, "кнопка", "300", 5], [9, "кошка", "200", 6], [10, "ноутбук", "500", 7], [11, "телевизор", "600", 1], [12, "открытка", "700", 2], [13, "попугай", "400", 3], [14, "гипопотам", "300", 4], [15, "али-баба", "200", 5], [16, "модем", "500", 6], [17, "шкаф", "600", 7], [18, "свитер", "700", 1], [19, "блок", "400", 2], [20, "сигара", "300", 3], [21, "стол", "200", 4], [22, "батон", "222", 9], [1, "банан", "400", 5], [2, "арбуз", "300", 6], [3, "помидор", "200", 7], [4, "ручка", "500", 1], [5, "карандаш", "600", 2], [6, "дыня", "700", 3], [7, "мышка", "400", 4], [8, "кнопка", "300", 5], [9, "кошка", "200", 6], [10, "ноутбук", "500", 7], [11, "телевизор", "600", 1], [12, "открытка", "700", 2], [13, "попугай", "400", 3], [14, "гипопотам", "300", 4], [15, "али-баба", "200", 5], [16, "модем", "500", 6], [17, "шкаф", "600", 7], [18, "свитер", "700", 1], [19, "блок", "400", 2], [20, "сигара", "300", 3], [21, "стол", "200", 4], [2, "арбуз", "300", 6], [3, "помидор", "200", 7], [4, "ручка", "500", 1], [5, "карандаш", "600", 2], [6, "дыня", "700", 3], [7, "мышка", "400", 4], [8, "кнопка", "300", 5], [9, "кошка", "200", 6], [10, "ноутбук", "500", 7], [11, "телевизор", "600", 1], [12, "открытка", "700", 2], [13, "попугай", "400", 3], [14, "гипопотам", "300", 4], [15, "али-баба", "200", 5], [16, "модем", "500", 6], [17, "шкаф", "600", 7], [18, "свитер", "700", 1], [19, "блок", "400", 2], [20, "сигара", "300", 3], [21, "стол", "200", 4], [2, "арбуз", "300", 6], [3, "помидор", "200", 7], [4, "ручка", "500", 1], [5, "карандаш", "600", 2], [6, "дыня", "700", 3], [7, "мышка", "400", 4], [8, "кнопка", "300", 5], [9, "кошка", "200", 6], [10, "ноутбук", "500", 7], [11, "телевизор", "600", 1], [12, "открытка", "700", 2], [13, "попугай", "400", 3], [14, "гипопотам", "300", 4], [15, "али-баба", "200", 5], [16, "модем", "500", 6], [17, "шкаф", "600", 7], [18, "свитер", "700", 1], [19, "блок", "400", 2], [20, "сигара", "300", 3], [21, "стол", "200", 4], [2, "арбуз", "300", 6], [3, "помидор", "200", 7], [4, "ручка", "500", 1], [5, "карандаш", "600", 2], [6, "дыня", "700", 3], [7, "мышка", "400", 4], [8, "кнопка", "300", 5], [9, "кошка", "200", 6], [10, "ноутбук", "500", 7], [11, "телевизор", "600", 1], [12, "открытка", "700", 2], [13, "попугай", "400", 3], [14, "гипопотам", "300", 4], [15, "али-баба", "200", 5], [16, "модем", "500", 6], [17, "шкаф", "600", 7], [18, "свитер", "700", 1], [19, "блок", "400", 2], [20, "сигара", "300", 3], [21, "стол", "200", 4], [2, "арбуз", "300", 6], [3, "помидор", "200", 7], [4, "ручка", "500", 1], [5, "карандаш", "600", 2], [6, "дыня", "700", 3], [7, "мышка", "400", 4], [8, "кнопка", "300", 5], [9, "кошка", "200", 6], [10, "ноутбук", "500", 7], [11, "телевизор", "600", 1], [12, "открытка", "700", 2], [13, "попугай", "400", 3], [14, "гипопотам", "300", 4], [15, "али-баба", "200", 5], [16, "модем", "500", 6], [17, "шкаф", "600", 7], [18, "свитер", "700", 1], [19, "блок", "400", 2], [20, "сигара", "300", 3], [21, "стол", "200", 4], [2, "арбуз", "300", 6], [3, "помидор", "200", 7], [4, "ручка", "500", 1], [5, "карандаш", "600", 2], [6, "дыня", "700", 3], [7, "мышка", "400", 4], [8, "кнопка", "300", 5], [9, "кошка", "200", 6], [10, "ноутбук", "500", 7], [11, "телевизор", "600", 1], [12, "открытка", "700", 2], [13, "попугай", "400", 3], [14, "гипопотам", "300", 4], [15, "али-баба", "200", 5], [16, "модем", "500", 6], [17, "шкаф", "600", 7], [18, "свитер", "700", 1], [19, "блок", "400", 2], [20, "сигара", "300", 3], [21, "стол", "200", 4], [2, "арбуз", "300", 6], [3, "помидор", "200", 7], [4, "ручка", "500", 1], [5, "карандаш", "600", 2], [6, "дыня", "700", 3], [7, "мышка", "400", 4], [8, "кнопка", "300", 5], [9, "кошка", "200", 6], [10, "ноутбук", "500", 7], [11, "телевизор", "600", 1], [12, "открытка", "700", 2], [13, "попугай", "400", 3], [14, "гипопотам", "300", 4], [15, "али-баба", "200", 5], [16, "модем", "500", 6], [17, "шкаф", "600", 7], [18, "свитер", "700", 1], [19, "блок", "400", 2], [20, "сигара", "300", 3], [21, "стол", "200", 4], [2, "арбуз", "300", 6], [3, "помидор", "200", 7], [4, "ручка", "500", 1], [5, "карандаш", "600", 2], [6, "дыня", "700", 3], [7, "мышка", "400", 4], [8, "кнопка", "300", 5], [9, "кошка", "200", 6], [10, "ноутбук", "500", 7], [11, "телевизор", "600", 1], [12, "открытка", "700", 2], [13, "попугай", "400", 3], [14, "гипопотам", "300", 4], [15, "али-баба", "200", 5], [16, "модем", "500", 6], [17, "шкаф", "600", 7], [18, "свитер", "700", 1], [19, "блок", "400", 2], [20, "сигара", "300", 3], [21, "стол", "200", 4], [2, "арбуз", "300", 6], [3, "помидор", "200", 7], [4, "ручка", "500", 1], [5, "карандаш", "600", 2], [6, "дыня", "700", 3], [7, "мышка", "400", 4], [8, "кнопка", "300", 5], [9, "кошка", "200", 6], [10, "ноутбук", "500", 7], [11, "телевизор", "600", 1], [12, "открытка", "700", 2], [13, "попугай", "400", 3], [14, "гипопотам", "300", 4], [15, "али-баба", "200", 5], [16, "модем", "500", 6], [17, "шкаф", "600", 7], [18, "свитер", "700", 1], [19, "блок", "400", 2], [20, "сигара", "300", 3], [21, "стол", "200", 4], [2, "арбуз", "300", 6], [3, "помидор", "200", 7], [4, "ручка", "500", 1], [5, "карандаш", "600", 2], [6, "дыня", "700", 3], [7, "мышка", "400", 4], [8, "кнопка", "300", 5], [9, "кошка", "200", 6], [10, "ноутбук", "500", 7], [11, "телевизор", "600", 1], [12, "открытка", "700", 2], [13, "попугай", "400", 3], [14, "гипопотам", "300", 4], [15, "али-баба", "200", 5], [16, "модем", "500", 6], [17, "шкаф", "600", 7], [18, "свитер", "700", 1], [19, "блок", "400", 2], [20, "сигара", "300", 3], [21, "стол", "200", 4], [2, "арбуз", "300", 6], [3, "помидор", "200", 7], [4, "ручка", "500", 1], [5, "карандаш", "600", 2], [6, "дыня", "700", 3], [7, "мышка", "400", 4], [8, "кнопка", "300", 5], [9, "кошка", "200", 6], [10, "ноутбук", "500", 7], [11, "телевизор", "600", 1], [12, "открытка", "700", 2], [13, "попугай", "400", 3], [14, "гипопотам", "300", 4], [15, "али-баба", "200", 5], [16, "модем", "500", 6], [17, "шкаф", "600", 7], [18, "свитер", "700", 1], [19, "блок", "400", 2], [20, "сигара", "300", 3], [21, "стол", "200", 4]];
    $scope.tableStructure = $scope.tableData.splice(0, 1)[0];
    /*GetTableData.get().then(function (res) {
        $scope.tableData = res;
        $scope.tableStructure = $scope.tableData.splice(0, 1)[0];
    });*/
}]);

app.directive("myTable", [function () {
    return {
        restrict: "E",
        templateUrl: "/templates/my-table.html",
        scope: {
            tableData: "=",
            tableStructure: "="
        },
        link: function link(scope) {
            scope.currentPage = 0;
            scope.itemsPerPage = 50;
            scope.items = scope.tableData;
            scope.propertyName = "id";
            scope.property = "0";
            scope.reverse = true;
            scope.tableStructureKeys = Object.keys(scope.tableStructure);
            scope.sortBy = function (property) {
                scope.propertyName = scope.tableStructureKeys[property];
                property = property.toString();
                scope.reverse = scope.property === property ? !scope.reverse : false;
                scope.property = property;
            };

            scope.lastPage = function () {
                var lastPageNum = void 0;
                if (scope.searchText != undefined && scope.searchText != "") {
                    lastPageNum = Math.ceil(scope.fliteredData.length / scope.itemsPerPage - 1);
                } else {
                    lastPageNum = Math.ceil(scope.items.length / scope.itemsPerPage - 1);
                }

                return scope.currentPage == lastPageNum;
            };

            scope.numberOfPages = function () {
                if (scope.searchText != undefined && scope.searchText != "") {

                    if (scope.fliteredData.length == 0) {
                        scope.currentPage = -1;
                        return 0;
                    } else {
                        scope.currentPage = 0;
                    }
                    return Math.ceil(scope.fliteredData.length / scope.itemsPerPage);
                } else {
                    return Math.ceil(scope.items.length / scope.itemsPerPage);
                }
            };
        }
    };
}]);
app.filter('startFrom', function () {
    return function (input, start) {
        start = +start;
        return input.slice(start);
    };
});

app.factory("GetTableData", ["$http", "$q", function ($http, $q) {

    function get() {
        var q = $q.defer();

        $http.get('../../products.json').success(function (data) {
            q.resolve(data);
        });

        return q.promise;
    }

    return {
        get: get
    };
}]);